/* Напишите реализацию метода insertIntoMiddle(int value, int pos) для списка мелкогранулярной блокировкой

	Функция должна вставить узел с переданным значением value в позицию pos.

	Чтобы не переусложнять реализацию, предполагается следующее:
		- очередь не пустая.
		- элемент вставляется в середину или конец списка, т.е. вставку в начало списка не нужно рассматривать.
		- если pos больше длины списка, то нужно вставить элемент в конец списка.

    Cама структура списка взята из юнита про мелкогранулярную блокировку.
 */

#include "FineGrainedQueue.h"

int main()
{
    FineGrainedQueue queue;

    return 0;
}